src/InformationRegisters/Scan_ПлановыеЗначенияСоставляющихЦеныПродукта/Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ПлановыеЗначенияСоставляющихЦеныПродукта</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставляющаяЦены</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_СоставляющиеРасчетаЦеныПродуктов/Scan_СоставляющиеРасчетаЦеныПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоставляющиеРасчетаЦеныПродуктов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИтоговыеЦены</name>
      <description>Итоговые цены</description>
    </items>
    <items>
      <name>КоэффициентыДляЦеныНаДилера</name>
      <description>Коэффициенты для цены на дилера</description>
    </items>
    <items>
      <name>КоэффициентыДляЦеныНаКлиента</name>
      <description>Коэффициенты для цены на клиента</description>
    </items>
    <items>
      <name>НерасчетныеСоставляющие</name>
      <description>Нерасчетные составляющие</description>
    </items>
    <items>
      <name>РасчетныеСоставляющие</name>
      <description>Расчетные составляющие</description>
    </items>
    <items>
      <name>СкидкиНаценки</name>
      <description>Скидки, наценки</description>
    </items>
  </predefined>
  <attributes>
    <name>ВариантФормированияРасчета</name>
    <type>
      <types>EnumRef.Scan_ВариантыФормированияРасчетаСоставляющихЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВКалькуляцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиКалькуляции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опция</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Применимость</name>
    <type>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>EnumRef.Scan_ПринадлежностьСоставляющихКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрядностьОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЦены</name>
    <type>
      <types>EnumRef.Scan_ТипыСоставляющихРасчетаСоставляющихЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяПакетомУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОпцииПакетаУслуг</name>
    <attributes>
      <name>БазоваяОпция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УточнениеЗначенийПоУмолчанию</name>
    <attributes>
      <name>ИдентификаторПрайсЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ПлановыеЗначенияСоставляющихЦеныПродукта/ManagerModule.bsl
// rarus tenkam 07.08.2020 mantis 16181 +++
Функция ПолучитьЦенуПродукта(Продукт, СоставляющаяЦены, СНДС = Истина) Экспорт
	СтруктураОтбора = Новый Структура("Продукт", Продукт);
	СтруктураОтбора.Вставить("СоставляющаяЦены", СоставляющаяЦены);
	
	Полученныеданные = РегистрыСведений.Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.Получить(ТекущаяДата(), СтруктураОтбора);
	
	Если НЕ ЗначениеЗаполнено(Полученныеданные) ИЛИ Полученныеданные.ЦенаСНДС = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если СНДС Тогда
		Возврат Полученныеданные.ЦенаСНДС;
	Иначе
		Возврат Полученныеданные.ЦенаБезНДС;
	КонецЕсли;
КонецФункции

Функция ПолучитьЦеныПродуктов(МассивПродуктов, СоставляющаяЦены) Экспорт
	СоответствиеПродуктЦена = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ПлановыеЗначенияСоставляющихЦеныПродуктаСрезПоследних.Продукт КАК Продукт,
		|	Scan_ПлановыеЗначенияСоставляющихЦеныПродуктаСрезПоследних.ЦенаСНДС КАК ЦенаСНДС
		|ИЗ
		|	РегистрСведений.Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.СрезПоследних(
		|			,
		|			Продукт В (&МассивПродуктов)
		|				И СоставляющаяЦены = &СоставляющаяЦены) КАК Scan_ПлановыеЗначенияСоставляющихЦеныПродуктаСрезПоследних";
	
	Запрос.УстановитьПараметр("МассивПродуктов", МассивПродуктов);
	Запрос.УстановитьПараметр("СоставляющаяЦены", СоставляющаяЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеПродуктЦена.Вставить(ВыборкаДетальныеЗаписи.Продукт, ВыборкаДетальныеЗаписи.ЦенаСНДС); 
	КонецЦикла;
	
	Возврат СоответствиеПродуктЦена;	
	
КонецФункции

Функция ПолучитьЗначенияВсехСоставляющихПродукта(Продукт, СНДС = Истина) Экспорт
	СоответствиеСоставляющих = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СоставляющиеРасчетаЦеныПродуктов.Ссылка КАК СоставляющаяЦены
		|ПОМЕСТИТЬ СоставляющиеЦеныПродуктаПлан
		|ИЗ
		|	Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов КАК Scan_СоставляющиеРасчетаЦеныПродуктов
		|ГДЕ
		|	(Scan_СоставляющиеРасчетаЦеныПродуктов.Родитель = ЗНАЧЕНИЕ(Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.СкидкиНаценки)
		|			ИЛИ Scan_СоставляющиеРасчетаЦеныПродуктов.Ссылка = ЗНАЧЕНИЕ(Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ЦенаДилера)
		|			ИЛИ Scan_СоставляющиеРасчетаЦеныПродуктов.Ссылка = ЗНАЧЕНИЕ(Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ЦенаКлиента))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СоставляющаяЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставляющиеЦеныПродуктаПлан.СоставляющаяЦены КАК СоставляющаяЦены,
		|	ЕСТЬNULL(Scan_ПлановыеЗначенияСоставляющихЦеныПродуктаСрезПоследних.ЦенаСНДС, 0) КАК ЦенаСНДС,
		|	ЕСТЬNULL(Scan_ПлановыеЗначенияСоставляющихЦеныПродуктаСрезПоследних.ЦенаБезНДС, 0) КАК ЦенаБезНДС,
		|	СоставляющиеЦеныПродуктаПлан.СоставляющаяЦены.ИмяПредопределенныхДанных КАК СоставляющаяЦеныИмяПредопределенныхДанных
		|ИЗ
		|	СоставляющиеЦеныПродуктаПлан КАК СоставляющиеЦеныПродуктаПлан
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.СрезПоследних(, Продукт = &Продукт) КАК Scan_ПлановыеЗначенияСоставляющихЦеныПродуктаСрезПоследних
		|		ПО СоставляющиеЦеныПродуктаПлан.СоставляющаяЦены = Scan_ПлановыеЗначенияСоставляющихЦеныПродуктаСрезПоследних.СоставляющаяЦены";
	
	Запрос.УстановитьПараметр("Продукт", Продукт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СНДС Тогда
			СоответствиеСоставляющих.Вставить(ВыборкаДетальныеЗаписи.СоставляющаяЦеныИмяПредопределенныхДанных, ВыборкаДетальныеЗаписи.ЦенаСНДС); 
		Иначе
			СоответствиеСоставляющих.Вставить(ВыборкаДетальныеЗаписи.СоставляющаяЦеныИмяПредопределенныхДанных, ВыборкаДетальныеЗаписи.ЦенаБезНДС); 
		КонецЕсли;

	КонецЦикла;
	
	Возврат СоответствиеСоставляющих;	
	
КонецФункции
// rarus tenkam 07.08.2020 manti 16181 ---
